<?php
/*
 * @copyright 2019-2021 Dicr http://dicr.org
 * @author Igor A Tarasov <develop@dicr.org>
 * @license proprietary
 * @version 23.02.21 11:51:43
 */

/** @noinspection SpellCheckingInspection */
declare(strict_types = 1);

return [
    'товар' => 'товар',
    'товара' => 'товари',
    'товаров' => 'товарів',

    'магазин' => 'магазин',
    'магазина' => 'магазини',
    'магазинов' => 'магазинів',

    'модель' => 'модель',
    'модели' => 'моделі',
    'моделей' => 'моделей',

    'отзыв' => 'відгук',
    'отзыва' => 'відгуки',
    'отзывов' => 'відгуків',

    'минута' => 'хвилина',
    'минуты' => 'хвилини',
    'минут' => 'хвилин',

    'час' => 'година',
    'часа' => 'години',
    'часов' => 'годин',

    'день' => 'день',
    'дня' => 'дні',
    'дней' => 'днів',

    'неделя' => 'тиждень',
    'недели' => 'тижні',
    'недель' => 'тижнів',
    'неделю' => 'тиждень',

    'месяц' => 'місяць',
    'месяца' => 'місяці',
    'месяцев' => 'місяців',

    'год' => 'рік',
    'года' => 'роки',
    'лет' => 'років',

    'сегодня' => 'сьогодні',
    'завтра' => 'завтра',
    'послезавтра' => 'післязавтра',

    'через' => 'через',

    'Пн' => 'Пн',
    'Вт' => 'Вт',
    'Ср' => 'Ср',
    'Чт' => 'Чт',
    'Пт' => 'Пт',
    'Сб' => 'Сб',
    'Вс' => 'Нд',

    'выходной' => 'вихідний',

    'янв' => 'січ',
    'фев' => 'лют',
    'мар' => 'бер',
    'апр' => 'кві',
    'май' => 'тра',
    'июн' => 'чер',
    'июл' => 'лип',
    'авг' => 'сер',
    'сен' => 'вер',
    'окт' => 'жов',
    'ноя' => 'лис',
    'дек' => 'гру',

    // с большой буквы для того чтобы "май" не совпадал с индексом коротких названий
    'Январь' => 'Січень',
    'Февраль' => 'Лютий',
    'Март' => 'Березень',
    'Апрель' => 'Квітень',
    'Май' => 'Травень',
    'Июнь' => 'Червень',
    'Июль' => 'Липень',
    'Август' => 'Серпень',
    'Сентябрь' => 'Вересень',
    'Октябрь' => 'Жовтень',
    'Ноябрь' => 'Листопад',
    'Декабрь' => 'Грудень',

    'января' => 'січня',
    'февраля' => 'лютого',
    'марта' => 'березня',
    'апреля' => 'квітня',
    'мая' => 'травня',
    'июня' => 'червня',
    'июля' => 'липня',
    'августа' => 'серпня',
    'сентября' => 'вересня',
    'октября' => 'жовтня',
    'ноября' => 'листопада',
    'декабря' => 'грудня',
];

